In [1]:
pip install ipython-sql

Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Requirement already satisfied: ipython-genutils in c:\users\asus\anacondadetails\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: six in c:\users\asus\anacondadetails\lib\site-packages (from ipython-sql) (1.16.0)
Collecting sqlalchemy>=2.0
  Downloading SQLAlchemy-2.0.19-cp310-cp310-win_amd64.whl (2.0 MB)
     ---------------------------------------- 2.0/2.0 MB 6.7 MB/s eta 0:00:00
Collecting prettytable
  Downloading prettytable-3.8.0-py3-none-any.whl (27 kB)
Requirement already satisfied: ipython in c:\users\asus\anacondadetails\lib\site-packages (from ipython-sql) (8.10.0)
Collecting sqlparse
  Downloading sqlparse-0.4.4-py3-none-any.whl (41 kB)
     ---------------------------------------- 41.2/41.2 kB 2.1 MB/s eta 0:00:00
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\asus\anacondadetails\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.4.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\asus\anacondadetails\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)
Requirement already satisfied: backcall in c:\users\asus\anacondadetails\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pickleshare in c:\users\asus\anacondadetails\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: matplotlib-inline in c:\users\asus\anacondadetails\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: colorama in c:\users\asus\anacondadetails\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator in c:\users\asus\anacondadetails\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\asus\anacondadetails\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: pygments>=2.4.0 in c:\users\asus\anacondadetails\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.30 in c:\users\asus\anacondadetails\lib\site-packages (from ipython->ipython-sql) (3.0.36)
Requirement already satisfied: stack-data in c:\users\asus\anacondadetails\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in c:\users\asus\anacondadetails\lib\site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: wcwidth in c:\users\asus\anacondadetails\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\asus\anacondadetails\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: pure-eval in c:\users\asus\anacondadetails\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens in c:\users\asus\anacondadetails\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: executing in c:\users\asus\anacondadetails\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Installing collected packages: sqlparse, sqlalchemy, prettytable, ipython-sql
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.4.39
    Uninstalling SQLAlchemy-1.4.39:
      Successfully uninstalled SQLAlchemy-1.4.39
Successfully installed ipython-sql-0.5.0 prettytable-3.8.0 sqlalchemy-2.0.19 sqlparse-0.4.4
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd
import sqlite3

In [5]:
%%!
pip install --trusted-host pypi.org ipython-sql

['Requirement already satisfied: ipython-sql in c:\\users\\asus\\anacondadetails\\lib\\site-packages (0.5.0)',
 'Requirement already satisfied: sqlalchemy>=2.0 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython-sql) (2.0.19)',
 'Requirement already satisfied: ipython in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython-sql) (8.10.0)',
 'Requirement already satisfied: six in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython-sql) (1.16.0)',
 'Requirement already satisfied: sqlparse in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython-sql) (0.4.4)',
 'Requirement already satisfied: prettytable in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython-sql) (3.8.0)',
 'Requirement already satisfied: ipython-genutils in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython-sql) (0.2.0)',
 'Requirement already satisfied: greenlet!=0.4.17 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)',
 'Requirement already satisfied: typing-extensions>=4.2.0 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.4.0)',
 'Requirement already satisfied: backcall in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (0.2.0)',
 'Requirement already satisfied: decorator in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (5.1.1)',
 'Requirement already satisfied: jedi>=0.16 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (0.18.1)',
 'Requirement already satisfied: pickleshare in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (0.7.5)',
 'Requirement already satisfied: matplotlib-inline in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (0.1.6)',
 'Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.30 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (3.0.36)',
 'Requirement already satisfied: traitlets>=5 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (5.7.1)',
 'Requirement already satisfied: pygments>=2.4.0 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (2.11.2)',
 'Requirement already satisfied: colorama in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (0.4.6)',
 'Requirement already satisfied: stack-data in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from ipython->ipython-sql) (0.2.0)',
 'Requirement already satisfied: wcwidth in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from prettytable->ipython-sql) (0.2.5)',
 'Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)',
 'Requirement already satisfied: pure-eval in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)',
 'Requirement already satisfied: asttokens in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)',
 'Requirement already satisfied: executing in c:\\users\\asus\\anacondadetails\\lib\\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)']

In [6]:
%load_ext sql

In [7]:
%sql sqlite://

In [9]:
%%sql

CREATE TABLE Departments (
  Code INTEGER PRIMARY KEY,
  Name varchar(255) NOT NULL ,
  Budget decimal NOT NULL 
);

 * sqlite://
Done.

[]

In [12]:
%%sql
describe Departments

 * sqlite://
(sqlite3.OperationalError) near "describe": syntax error
[SQL: describe Departments]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [13]:
%%sql
INSERT INTO Departments(Code,Name,Budget) VALUES(14,'IT',65000);
INSERT INTO Departments(Code,Name,Budget) VALUES(37,'Accounting',15000);
INSERT INTO Departments(Code,Name,Budget) VALUES(59,'Human Resources',240000);
INSERT INTO Departments(Code,Name,Budget) VALUES(77,'Research',55000);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%%sql 
select * from Departments

 * sqlite://
Done.

[(14, 'IT', 65000),
 (37, 'Accounting', 15000),
 (59, 'Human Resources', 240000),
 (77, 'Research', 55000)]

In [15]:
%%sql 
CREATE TABLE Employees (
  SSN INTEGER PRIMARY KEY,
  Name varchar(255) NOT NULL ,
  LastName varchar(255) NOT NULL ,
  Department INTEGER NOT NULL , 
  foreign key (department) references Departments(Code) 
);

 * sqlite://
Done.

[]

In [17]:
%%sql
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('123234877','Michael','Rogers',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('152934485','Anand','Manikutty',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('222364883','Carol','Smith',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('326587417','Joe','Stevens',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332154719','Mary-Anne','Foster',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332569843','George','ODonnell',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('546523478','John','Doe',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('631231482','David','Smith',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('654873219','Zacary','Efron',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('745685214','Eric','Goldsmith',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657245','Elizabeth','Doe',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657246','Kumar','Swamy',14);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [18]:
%%sql
select * from Employees

 * sqlite://
Done.

[(123234877, 'Michael', 'Rogers', 14),
 (152934485, 'Anand', 'Manikutty', 14),
 (222364883, 'Carol', 'Smith', 37),
 (326587417, 'Joe', 'Stevens', 37),
 (332154719, 'Mary-Anne', 'Foster', 14),
 (332569843, 'George', 'ODonnell', 77),
 (546523478, 'John', 'Doe', 59),
 (631231482, 'David', 'Smith', 77),
 (654873219, 'Zacary', 'Efron', 59),
 (745685214, 'Eric', 'Goldsmith', 59),
 (845657245, 'Elizabeth', 'Doe', 14),
 (845657246, 'Kumar', 'Swamy', 14)]

In [ ]:
2.1 Select the last name of all employees.
-- 2.2 Select the last name of all employees, without duplicates.
-- 2.3 Select all the data of employees whose last name is "Smith".
-- 2.4 Select all the data of employees whose last name is "Smith" or "Doe".
-- 2.5 Select all the data of employees that work in department 14.
-- 2.6 Select all the data of employees that work in department 37 or department 77.
-- 2.7 Select all the data of employees whose last name begins with an "S".
-- 2.8 Select the sum of all the departments' budgets.
-- 2.9 Select the number of employees in each department (you only need to show the department code and the number of employees).
-- 2.10 Select all the data of employees, including each employee's department's data.
-- 2.11 Select the name and last name of each employee, along with the name and budget of the employee's department.
-- 2.12 Select the name and last name of employees working for departments with a budget greater than $60,000.
-- 2.13 Select the departments with a budget larger than the average budget of all the departments.
-- 2.14 Select the names of departments with more than two employees.
-- 2.15 Very Important - Select the name and last name of employees working for departments with second lowest budget.
-- 2.16  Add a new department called "Quality Assurance", with a budget of $40,000 and departmental code 11. 
-- And Add an employee called "Mary Moore" in that department, with SSN 847-21-9811.
-- 2.17 Reduce the budget of all departments by 10%.
-- 2.18 Reassign all employees from the Research department (code 77) to the IT department (code 14).
-- 2.19 Delete from the table all employees in the IT department (code 14).
-- 2.20 Delete from the table all employees who work in departments with a budget greater than or equal to $60,000.
-- 2.21 Delete from the table all employees.

In [19]:
%%sql
select LastName from Employees

 * sqlite://
Done.

[('Rogers',),
 ('Manikutty',),
 ('Smith',),
 ('Stevens',),
 ('Foster',),
 ('ODonnell',),
 ('Doe',),
 ('Smith',),
 ('Efron',),
 ('Goldsmith',),
 ('Doe',),
 ('Swamy',)]

In [20]:
%%sql
select * from Employees where LastName = 'Smith'

 * sqlite://
Done.

[(222364883, 'Carol', 'Smith', 37), (631231482, 'David', 'Smith', 77)]

In [21]:
%%sql
select * from Employees where LastName = 'Smith' or LastName = 'Doe';

 * sqlite://
Done.

[(222364883, 'Carol', 'Smith', 37),
 (546523478, 'John', 'Doe', 59),
 (631231482, 'David', 'Smith', 77),
 (845657245, 'Elizabeth', 'Doe', 14)]

In [22]:
%%sql
select * from Employees where Department = 14

 * sqlite://
Done.

[(123234877, 'Michael', 'Rogers', 14),
 (152934485, 'Anand', 'Manikutty', 14),
 (332154719, 'Mary-Anne', 'Foster', 14),
 (845657245, 'Elizabeth', 'Doe', 14),
 (845657246, 'Kumar', 'Swamy', 14)]

In [23]:
%%sql
select * from Employees where Department = 37 or Department = 77

 * sqlite://
Done.

[(222364883, 'Carol', 'Smith', 37),
 (326587417, 'Joe', 'Stevens', 37),
 (332569843, 'George', 'ODonnell', 77),
 (631231482, 'David', 'Smith', 77)]

In [24]:
%%sql 
select * from Employees where LastName like 'S%'

 * sqlite://
Done.

[(222364883, 'Carol', 'Smith', 37),
 (326587417, 'Joe', 'Stevens', 37),
 (631231482, 'David', 'Smith', 77),
 (845657246, 'Kumar', 'Swamy', 14)]

In [28]:
%%sql
select Name, sum(Budget) from Departments
group by Name;

 * sqlite://
Done.

[('Accounting', 15000),
 ('Human Resources', 240000),
 ('IT', 65000),
 ('Research', 55000)]

In [ ]:
Select the number of employees in each department (you only need to show the department code and the number of employees)

In [31]:
%%sql
SELECT Department, COUNT(*)
  FROM Employees
  GROUP BY Department;

 * sqlite://
Done.

[(14, 5), (37, 2), (59, 3), (77, 2)]

In [33]:
%%sql
select a.*, b.* from employees a join departments b on a.department = b.code;

 * sqlite://
Done.

[(123234877, 'Michael', 'Rogers', 14, 14, 'IT', 65000),
 (152934485, 'Anand', 'Manikutty', 14, 14, 'IT', 65000),
 (222364883, 'Carol', 'Smith', 37, 37, 'Accounting', 15000),
 (326587417, 'Joe', 'Stevens', 37, 37, 'Accounting', 15000),
 (332154719, 'Mary-Anne', 'Foster', 14, 14, 'IT', 65000),
 (332569843, 'George', 'ODonnell', 77, 77, 'Research', 55000),
 (546523478, 'John', 'Doe', 59, 59, 'Human Resources', 240000),
 (631231482, 'David', 'Smith', 77, 77, 'Research', 55000),
 (654873219, 'Zacary', 'Efron', 59, 59, 'Human Resources', 240000),
 (745685214, 'Eric', 'Goldsmith', 59, 59, 'Human Resources', 240000),
 (845657245, 'Elizabeth', 'Doe', 14, 14, 'IT', 65000),
 (845657246, 'Kumar', 'Swamy', 14, 14, 'IT', 65000)]

In [34]:
%%sql 
SELECT E.Name, LastName, D.Name AS DepartmentsName, Budget
  FROM Employees E INNER JOIN Departments D
  ON E.Department = D.Code;

 * sqlite://
Done.

[('Michael', 'Rogers', 'IT', 65000),
 ('Anand', 'Manikutty', 'IT', 65000),
 ('Carol', 'Smith', 'Accounting', 15000),
 ('Joe', 'Stevens', 'Accounting', 15000),
 ('Mary-Anne', 'Foster', 'IT', 65000),
 ('George', 'ODonnell', 'Research', 55000),
 ('John', 'Doe', 'Human Resources', 240000),
 ('David', 'Smith', 'Research', 55000),
 ('Zacary', 'Efron', 'Human Resources', 240000),
 ('Eric', 'Goldsmith', 'Human Resources', 240000),
 ('Elizabeth', 'Doe', 'IT', 65000),
 ('Kumar', 'Swamy', 'IT', 65000)]

In [ ]:
/* Select the name and last name of employees working for departments with a budget greater than $60,000.*/

In [ ]:
select e.Name, e.lastname from Employees e inner join Departments d 
 ON Employees.Department = Departments.Code
    AND Departments.Budget > 60000;

In [ ]:
Select the departments with a budget larger than the average budget of all the departments.

In [37]:
%%sql
SELECT *
  FROM Departments
  WHERE Budget >
  (
    SELECT AVG(Budget)
    FROM Departments
  );

 * sqlite://
Done.

[(59, 'Human Resources', 240000)]

In [ ]:
 Select the names of departments with more than two employees.

In [38]:
%%sql
SELECT Name FROM Departments
  WHERE Code IN
  (
    SELECT Department
      FROM Employees
      GROUP BY Department
      HAVING COUNT(*) > 2
  );

 * sqlite://
Done.

[('IT',), ('Human Resources',)]

In [39]:
%%sql
select name, lastname
from employees
where department =(
select temp.code 
from (select * from departments order by budget limit 2) temp
order by temp.budget desc limit 1
);

 * sqlite://
Done.

[('George', 'ODonnell'), ('David', 'Smith')]

In [40]:
%%sql
insert into departments values(11, 'Quality Assurance', 40000);
insert into employees values(847219811, 'Mary', 'Moore', 11);

 * sqlite://
1 rows affected.
1 rows affected.

[]

In [41]:
%%sql
update departments 
set budget = 0.9 * budget;

 * sqlite://
5 rows affected.

[]

In [42]:
%%sql
update employees
set department = 14
where department = 77;

 * sqlite://
2 rows affected.

[]

In [43]:
%%sql 
delete from employees
where department = 14;

 * sqlite://
7 rows affected.

[]

In [44]:
%%sql
delete from employees
where department in (
select code 
from departments
where budget>=60000
);

 * sqlite://
3 rows affected.

[]

In [45]:
%%sql
delete from employees;

 * sqlite://
3 rows affected.

[]

In [47]:
%%sql
select * from employees;

 * sqlite://
Done.

[]